_posts/2014-02-17-yasnippets-for-jasp,-ase-and-python.html
---
title: yasnippets for jasp, ase and python
date: 2014/02/17 09:03:50
updated: 2014/02/17 09:03:50
categories: jasp,ase,emacs
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tangle the snippets, and add them to yasnippet</a></li>
<li><a href="#sec-2">2. Using the snippets</a></li>
<li><a href="#sec-3">3. Appendix</a>
<ul>
<li><a href="#sec-3-1">3.1. jasp snippets</a></li>
<li><a href="#sec-3-2">3.2. ase snippets</a></li>
<li><a href="#sec-3-3">3.3. python snippets</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
In using [[<a href="http://github.com/jkitchin/jasp">http://github.com/jkitchin/jasp</a> for calculations, I find there are lots of small python phrases I use over and over. Today I will examine using <a href="http://capitaomorte.github.io/yasnippet/index.html">yasnippet</a> to save time and keystrokes. yasnippet is a template expansion module, where you type a small set of characters, press <code>Tab</code>, and the
characters "expand" to the full text. It is pretty sophisticated, and allows you to define "tab-stops" which you interactively fill in, and tab between like filling in a form.
</p>

<p>
All the snippets are defined in the <pre>*Appendix</pre> .
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tangle the snippets, and add them to yasnippet</h2>
<div class="outline-text-2" id="text-1">
<p>
Each snippet definition belongs in a file in a directory. The main directory is called "snippets". Since I anticipate using these snippets in org-mode, each snippet is defined in a directory within snippets called "org-mode". First, we make the directory here. I also want to use the snippets in python mode, so we also create a python-mode directory here. We do not have to duplicate the snippets. We can create a file called <a href="http://capitaomorte.github.io/yasnippet/snippet-organization.html">.yas-parents</a> , with one line in it containing "org-mode".
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir -p snippets/org-mode
mkdir -p snippets/python-mode
<span style="color: #cd0000;">echo</span> <span style="color: #228b22;">"org-mode"</span> &gt; snippets/python-mode/.yas-parents
</pre>
</div>

<p>
Each snippet is defined in a src block with  a <code>:tangle</code> header. So, we can extract them all in one command here.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-babel-tangle)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">snippets/org-mode/iase</td>
<td class="left">snippets/org-mode/imp</td>
<td class="left">snippets/org-mode/inp</td>
<td class="left">snippets/org-mode/ij</td>
<td class="left">snippets/org-mode/pl</td>
<td class="left">snippets/org-mode/pyl</td>
<td class="left">snippets/org-mode/pxl</td>
<td class="left">snippets/org-mode/pp</td>
<td class="left">snippets/org-mode/npa</td>
<td class="left">snippets/org-mode/awt</td>
<td class="left">snippets/org-mode/avw</td>
<td class="left">snippets/org-mode/agf</td>
<td class="left">snippets/org-mode/ape</td>
<td class="left">snippets/org-mode/atms</td>
<td class="left">snippets/org-mode/atm</td>
<td class="left">snippets/org-mode/cga</td>
<td class="left">snippets/org-mode/cc</td>
<td class="left">snippets/org-mode/wjn</td>
<td class="left">snippets/org-mode/wjl</td>
</tr>
</tbody>
</table>

<p>
We also need to add our new directory to yasnippets. This is done by adding the directory to the <code>yas-snippet-dirs</code> variable. You could add this to your init.el file to permanently add these snippets.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'yas-snippet-dirs <span style="color: #228b22;">"c:/Users/jkitchin/Dropbox/blogofile-jkitchin.github.com/_blog/snippets"</span>)
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">c:/Users/jkitchin/Dropbox/blogofile-jkitchin.github.com/<sub>blog</sub>/snippets</td>
<td class="left">~/.emacs.d/snippets</td>
<td class="left">c:/users/jkitchin/Dropbox/kitchingroup/jmax/elpa/yasnippet-20140106.1009/snippets</td>
</tr>
</tbody>
</table>

<p>
Finally, we reload all the snippet definitions, so our new definitions are ready to use.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(yas-reload-all)
</pre>
</div>

<pre class="example">
[yas] Reloaded everything (snippets will load just-in-time)... (some errors, check *Messages*).
</pre>

<p>
Alternatively, you might just load this directory.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(yas-load-directory <span style="color: #228b22;">"./snippets"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Using the snippets</h2>
<div class="outline-text-2" id="text-2">
<p>
Each of these snippets is for a python phrase, but I usually write my python blocks in org-mode. You would use these by typing the shortcut name, and then pressing tab. Below I show what each shortcut expands to.
</p>

<p>
wjl &rarr; <code>with jasp('') as calc:</code>
</p>

<p>
wjn &rarr; <code>with jasp('',) as calc:</code>
    <code>calc.calculate(atoms)</code>
</p>

<p>
cc  &rarr; <code>calc.calculate(atoms)</code>
</p>

<p>
cga &rarr; <code>atoms = calc.get_atoms()</code>
</p>

<p>
atm &rarr; <code>Atom('', )</code>
</p>

<p>
atms &rarr; <code>atoms = Atoms([], cell</code>)=
</p>

<p>
ape &rarr; <code>atoms.get_potential_energy()</code>
</p>

<p>
agf &rarr; <code>atoms.get_forces()</code>
</p>

<p>
avw &rarr; <code>from ase.visualize import view</code>
<code>view(atoms)</code>
</p>

<p>
awt &rarr; <code>from ase.io import write</code>
<code>write('.png', atoms, show_unit_cell=2)</code>
</p>

<p>
npa &rarr; <code>np.array()</code>
</p>

<p>
pp &rarr; <code>plt.plot(, )</code>
</p>

<p>
pxl &rarr; <code>plt.xlabel()</code>
</p>

<p>
pyl &rarr; <code>plt.ylabel()</code>
</p>

<p>
pl &rarr; <code>plt.legend()</code>
</p>

<p>
ij &rarr; <code>from jasp import *</code>
</p>

<p>
inp &rarr; <code>import numpy as np</code>
</p>

<p>
imp &rarr; <code>import matplotlib.pyplot as plt</code>
</p>

<p>
iase &rarr; <code>from ase import Atom, Atoms</code>
</p>

<p>
What other snippets would be handy?
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Appendix</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> jasp snippets</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
with jasp('$1') as calc:
    $0
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
with jasp('$1',$0) as calc:
    calc.calculate(atoms)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
calc.calculate(atoms)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
atoms = calc.get_atoms()
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> ase snippets</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Template for an ase.Atom
</p>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
Atom('$1', $2)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
atoms = Atoms([$1], cell=$2)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
atoms.get_potential_energy()
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
atoms.get_forces()
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
from ase.visualize import view
view(${1:atoms})
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
from ase.io import write
write('$1.png', ${2:atoms}, show_unit_cell=${3:2})
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> python snippets</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
import numpy as np
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
import matplotlib.pyplot as plt
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
from ase import Atom, Atoms
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
np.array($0)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
plt.plot($1, $2)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
plt.xlabel($1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
plt.ylabel($1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
plt.legend($1)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-snippet"># -*- mode: snippet -*-
# --
from jasp import *
</pre>
</div>
</div>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/02/17/yasnippets-for-jasp,-ase-and-python.org">org-mode source</a><p><p>Org-mode version = 8.2.5h</p>